ultimachine/FeynmanCore/boards.txt
feynman.name=Feynman
feynman.upload.tool=bossac
feynman.upload.protocol=sam-ba
feynman.upload.maximum_size=524288
feynman.upload.use_1200bps_touch=true
feynman.upload.wait_for_upload_port=true
feynman.upload.native_usb=true
feynman.build.mcu=cortex-m4
feynman.build.series=samg55
feynman.build.f_cpu=120029184L
feynman.build.usb_product="Feynman"
feynman.build.usb_manufacturer="UltiMachine"
feynman.build.board=__SAMFEYNMAN__
feynman.build.core=core3
feynman.build.extra_flags=-D__SAMG55J19__ -mthumb {build.usb_flags}
feynman.build.ldscript=linker_scripts/gcc/samg55j19_flash_16kbootloader.ld
feynman.build.variant=feynman
feynman.build.vid=0x27b1
feynman.build.pid=0x0001